{
    "projects": [
        {
            "title": "Carbon footprint tracker",
            "body": [
                "A web application created with MEAN stack to track carbon emissions over a journey based on factors including distance travelled, transport mode, etc. while mapping out the journey on an interactive map.",
                "The application has a social aspect as well, with live tweets relevant to the topic are streamed onto the app using Apache Kafka and a news API currently being integrated.",
                "Technologies used: Angular, Node.js, Java, MongoDB, Express, ElasticSearch, Apache Kafka, agm-direction, Redis, polyline, Google distance matrix, AWS EC2, Git, Inginx"
            ],
            "links": [
                {
                    "title": "View online",
                    "link": "http://trackcarbon.online/"
                },
                {
                    "title": "Github (UI)",
                    "link": "https://github.com/arvindkumar422/carbon-footprint-frontend"
                },
                {
                    "title": "Github (API)",
                    "link": "https://github.com/BrundaSreedhar/carbon-footprint-backend"
                }
            ],
            "image": "../../assets/images/carbon.jpg"
        },
        {
            "title": "Recognize anything?",
            "body": [
                "A website created using React and Python to detect faces, food, items and patterns in an image submitted as a URL.",
                "The application makes use of 2 APIs - The ClarifAI API which is external and an OpenCV API written by me in Python using Flask and deployed on AWS Elastic Beanstalk. The user may choose either of these and compare/contrast their performance.",
                "Technologies used: React, Flask, Python, OpenCV, Caffe, ClarifAI API, AWS Amplify, Git, Elastic Beanstalk, Font Awesome, Bootstrap, CSS"
            ],
            "links": [
                {
                    "title": "View online",
                    "link": "https://master.d18ewnc11uvlgk.amplifyapp.com/"
                },
                {
                    "title": "Github (UI)",
                    "link": "https://github.com/arvindkumar422/image-recognition-website"
                },
                {
                    "title": "Github (API)",
                    "link": "https://github.com/arvindkumar422/img-backend"
                }
            ],
            "image": "../../assets/images/logo.png"
        },
        {
            "title": "Distributed file service",
            "body": [
                "A fault tolerant Distributed file system built with Java that facilitates multithreaded access for users to interact with multiple servers to perform CRUD operations on files stored and replicated across these servers.",
                "Program enforces Mutual exclusion, data replication, distributed transaction, fault tolerance, consistency and consensus.",
                "Technologies/concepts used: Java, Load balanceing, Paxos consensus algorithm, Socket programming"
            ],
            "links": [
                {
                    "title": "Github",
                    "link": "https://github.com/arvindkumar422/Distributed-File-System"
                }
            ],
            "image": "../../assets/images/dist.png"
        },
        {
            "title": "Microtix",
            "body": [
                "An E-commerce ticketing application built with Microservices predominantly using Node.js, React, Docker, Kubernetes.",
                "A number of microservices were implented using Node - Authentiation, Payments, Orders, Tickets and Payments. A common module was also extracted into an npm module and uploaded online as an npm package. This project taught me how complicated a Micoservice architecture can be to build, scale and deploy.",
                "Technologies used: Node.js, Next.js, NATS, Skaffold, Ingress, MongoDB, Stripe.js, Docker, Kubernetes, Express, DigitalOcean, Git, npm"
            ],
            "links": [
                {
                    "title": "View online",
                    "link": "http://www.arvindtix.xyz/"
                },
                {
                    "title": "Github",
                    "link": "https://github.com/arvindkumar422/ticketing-node-kubernetes"
                }
            ],
            "image": "../../assets/images/tix.png"
        },
        {
            "title": "False Nine",
            "body": [
                "A sports website built around soccer for news, live scores, leagues, standings, etc developed with React, MongoDB and Node.js.",
                "Also integreated are a set of user functionalities like a discussion forum allowing registered users to paticipate in. 3 levels of users are supported - normal user, pro-user with access to extra soccer leagues, and admin user with admin privileges like banning other users.",
                "Technologies used: React, Express, Node.js, Node.js, MongoDB, Bootstrap, external APIs, Heroku, Git"
            ],
            "links": [
                {
                    "title": "Github (UI)",
                    "link": "https://github.com/nikhilnair23/soccer-website"
                },
                {
                    "title": "Github (API)",
                    "link": "https://github.com/arvindkumar422/soccer-server"
                }
            ],
            "image": "../../assets/images/soccer.png"
        }
    ]
}